Repository: Abhishekkx/LEGAL-DOST-FLUTTER-APP
Catalog: lib/l10n/app_*.arb
Languages: hi

# legalAdvice
source: Get Legal Suggestions
hi: कानूनी सुझाव प्राप्त करें

# enterCaseDetails
source: Explain Your Case
hi: अपना मामला बताएं

# enterCaseDetailsHint
source: Describe your situation...
hi: अपनी स्थिति का वर्णन करें...

source: Record
hi: रिकॉर्ड करें

source: Stop Recording
hi: रिकॉर्डिंग रोकें

# getSuggestion
source: Submit
hi: जमा करें

source: Legal Suggestions
hi: कानूनी सुझाव

# speechNotAvailable
source: Speech recognition not available
hi: वाक् पहचान उपलब्ध नहीं है

# speechInitError
source: Speech initialization error
hi: वाक् प्रारंभ त्रुटि

# speechNotInitialized
source: Speech not initialized. Try again.
hi: वाक् प्रारंभ नहीं हुआ। पुनः प्रयास करें।

source: Recording error
hi: रिकॉर्डिंग त्रुटि

# enterCaseDetailsPrompt
source: Please enter or record case details.
hi: कृपया मामले का विवरण दर्ज करें या रिकॉर्ड करें।

# errorFetching
source: Error fetching suggestions
hi: सुझाव प्राप्त करने में त्रुटि

source: Legal Information
hi: कानूनी जानकारी

source: File Your Case
hi: अपना मामला दर्ज करें

# appTitle
source: Legal Dost
hi: लीगल दोस्त

source: Quizzes
hi: प्रश्नोत्तरी

source: Get Legal Suggestions
hi: कानूनी सुझाव प्राप्त करें

# welcomeMessage
source: Welcome to Legal Dost!
hi: लीगल दोस्त में आपका स्वागत है!

# generalActsTab
source: General Acts
hi: सामान्य अधिनियम

# scenarioBasedTab
source: Scenario-Based
hi: परिदृश्य-आधारित

# fileEFIR
source: File an E-FIR
hi: ई-एफआईआर दर्ज करें

source: Report Cyber Crime
hi: साइबर अपराध की रिपोर्ट करें

source: Emergency Numbers
hi: आपातकालीन पुलिस नंबर

source: Select State
hi: राज्य चुनें

source: Delhi
hi: दिल्ली

source: Maharashtra
hi: महाराष्ट्र

source: West Bengal
hi: पश्चिम बंगाल

source: Tamil Nadu
hi: तमिलनाडु

source: Jharkhand
hi: झारखंड

source: Haryana
hi: हरियाणा

source: Madhya Pradesh
hi: मध्य प्रदेश

source: Visit Website
hi: वेबसाइट पर जाएं

# nationalCyberPortal
source: National Cyber Crime Reporting Portal
hi: राष्ट्रीय साइबर अपराध रिपोर्टिंग पोर्टल

# reportLocalPolice
source: Report to Local Police Station
hi: स्थानीय पुलिस स्टेशन में रिपोर्ट करें

source: Emergency Helpline
hi: आपातकालीन हेल्पलाइन

source: Call Now
hi: अब कॉल करें

# emailSP
source: Email Superintendent of Police if police inaction occurs.
hi: यदि पुलिस कार्रवाई नहीं होती तो पुलिस अधीक्षक को ईमेल करें।

# writtenComplaint
source: You can also file a written complaint at your nearest police station.
hi: यदि आवश्यक हो तो उच्च अधिकारियों को लिखित शिकायत दें।

source: Hire Lawyer
hi: वकील किराए पर लें

# userRole
source: User
hi: उपयोगकर्ता

# lawyerRole
source: Lawyer
hi: वकील

source: Lawyer Registration
hi: वकील पंजीकरण

source: Name
hi: नाम

# nameRequired
source: Name is required.
hi: नाम आवश्यक है।

source: Email
hi: ईमेल

# emailRequired
source: Email is required
hi: ईमेल आवश्यक है

# invalidEmail
source: Invalid email format
hi: अमान्य ईमेल प्रारूप

source: Phone Number
hi: फ़ोन नंबर

# phoneRequired
source: Phone number is required.
hi: फ़ोन नंबर आवश्यक है।

# invalidPhone
source: Please enter a valid 10-digit phone number.
hi: कृपया एक वैध 10-अंकीय फ़ोन नंबर दर्ज करें।

source: Experience (Years)
hi: अनुभव (वर्ष)

# experienceRequired
source: Please select your experience level.
hi: कृपया अपना अनुभव स्तर चुनें।

# invalidExperience
source: Experience must be a number
hi: अनुभव एक संख्या होनी चाहिए

source: Expertise
hi: विशेषज्ञता

# expertiseRequired
source: Please select your area of expertise.
hi: कृपया अपना विशेषज्ञता क्षेत्र चुनें।

source: Cases Handled
hi: संचालित मामले

# casesHandledRequired
source: Number of cases handled is required
hi: मामलों की संख्या आवश्यक है

# invalidCasesHandled
source: Cases handled must be a number
hi: मामलों की संख्या एक संख्या होनी चाहिए

# whyBest
source: Why You Are the Best
hi: आप सबसे अच्छे क्यों हैं

# whyBestRequired
source: This field is required
hi: यह फ़ील्ड आवश्यक है

source: Send OTP
hi: ओटीपी भेजें

source: Enter OTP
hi: ओटीपी दर्ज करें

# otpRequired
source: OTP is required
hi: ओटीपी आवश्यक है

# invalidOtp
source: OTP must be 6 digits
hi: ओटीपी 6 अंकों का होना चाहिए

source: Verify OTP
hi: ओटीपी सत्यापित करें

source: Save Profile
hi: प्रोफ़ाइल सहेजें

# noContentAvailable
source: No legal content available.
hi: कोई कानूनी सामग्री उपलब्ध नहीं है।

source: Search Legal Topics
hi: कानूनी विषय खोजें

source: General Acts
hi: सामान्य कानून

source: Scenario-Based
hi: परिदृश्य आधारित

source: Submit
hi: जमा करें

source: Next
hi: अगला

source: Retry
hi: पुनः प्रयास करें

source: No quiz available.
hi: कोई प्रश्नोत्तरी उपलब्ध नहीं है।

source: Legal Aid Updates
hi: कानूनी सहायता अपडेट

# typesOfLegalAid
source: Types of Legal Aid in India
hi: भारत में कानूनी सहायता के प्रकार

# freeLegalServices
source: 1. Free Legal Services
hi: 1. निःशुल्क कानूनी सेवाएँ

# freeLegalServicesDescription
source: Provided to marginalized communities, including women, children, and laborers.
hi: सीमांत समुदायों, महिलाओं, बच्चों और मजदूरों को प्रदान की जाती है।

# legalAidClinics
source: 2. Legal Aid Clinics
hi: 2. कानूनी सहायता क्लीनिक

# legalAidClinicsDescription
source: Available in rural areas, villages, courts, and law schools.
hi: ग्रामीण क्षेत्रों, गांवों, अदालतों और लॉ स्कूलों में उपलब्ध।

# helplines
source: 3. Helplines
hi: 3. हेल्पलाइन

# nationalLegalHelpline
source: National Legal Helpline: 15100
hi: राष्ट्रीय कानूनी हेल्पलाइन: 15100

# womenHelpline
source: Women Helpline: 181
hi: महिला हेल्पलाइन: 181

# childHelpline
source: Child Helpline: 1098
hi: बाल हेल्पलाइन: 1098

# publicInterestLitigation
source: 4. Public Interest Litigation (PIL)
hi: 4. लोकहित याचिका (PIL)

# publicInterestLitigationDescription
source: For social justice and public interest cases.
hi: सामाजिक न्याय और लोकहित मामलों के लिए।

# ngoSupport
source: 5. NGO Support
hi: 5. NGO सहायता

# ngoSupportDescription
source: Support from organizations like CRY.
hi: CRY जैसे संगठनों से सहायता।

# howToGetLegalAid
source: How to Get Legal Aid in India
hi: भारत में कानूनी सहायता कैसे प्राप्त करें

# verifyEligibility
source: Step 1: Verify Eligibility
hi: चरण 1: पात्रता की जाँच

# verifyEligibilityDescription
source: Ensure you belong to a marginalized group (e.g., BPL, SC/ST, women, children) or cannot afford a lawyer.
hi: यह सुनिश्चित करें कि आप किसी सीमांत समूह (जैसे बीपीएल, एससी/एसटी, महिलाएँ, बच्चे) से हैं या वकील नहीं अफोर्ड कर सकते।

# approachLegalServicesAuthority
source: Step 2: Approach Legal Services Authority
hi: चरण 2: कानूनी सेवा प्राधिकरण से संपर्क करें

# approachLegalServicesAuthorityDescription
source: Visit your District Legal Services Authority (DLSA) office or call the helpline (15100).
hi: अपने जिला कानूनी सेवा प्राधिकरण (DLSA) कार्यालय पर जाएँ या हेल्पलाइन (15100) पर कॉल करें।

# submitApplication
source: Step 3: Submit Application
hi: चरण 3: आवेदन जमा करें

# submitApplicationDescription
source: Fill out an application form with personal details and proof of eligibility (e.g., income certificate).
hi: निजी विवरण और पात्रता का प्रमाण (जैसे आय प्रमाण पत्र) के साथ आवेदन फॉर्म भरें।

# legalAidAssignment
source: Step 4: Legal Aid Assignment
hi: चरण 4: कानूनी सहायता का आवंटन

# legalAidAssignmentDescription
source: A government lawyer will be assigned to represent you in court or provide advice.
hi: कोर्ट में आपका प्रतिनिधित्व करने या सलाह देने के लिए एक सरकारी वकील नियुक्त किया जाएगा।

# followUp
source: Step 5: Follow-Up
hi: चरण 5: अनुवर्ती कार्रवाई

# followUpDescription
source: Track your case progress through the DLSA or helpline.
hi: DLSA या हेल्पलाइन के माध्यम से अपने मामले की प्रगति पर नज़र रखें।

source: Official Resources
hi: आधिकारिक संसाधन

source: NALSA Website
hi: NALSA वेबसाइट

source: Ministry of Home Affairs
hi: गृह मंत्रालय

# efirSteps
source: Steps to file an E-FIR:
hi: ई-एफआईआर दर्ज करने के चरण:

# policeEmergency
source: Police Emergency: 100
hi: पुलिस आपातकाल: 100

# allIndiaHelpline
source: All India Helpline: 112
hi: ऑल इंडिया हेल्पलाइन: 112

source: Emergency Number
hi: आपातकालीन नंबर

# appName
source: Legal Dost
hi: लीगल दोस्त

# takeQuiz
source: Take a Quiz
hi: क्विज़ लें

# fileCase
source: File a Case
hi: मामला दर्ज करें

source: Hire a Lawyer
hi: वकील किराए पर लें

source: Legal Aid
hi: कानूनी सहायता

source: Get Legal Advice
hi: कानूनी सलाह प्राप्त करें

source: Filter by Expertise
hi: विशेषज्ञता के आधार पर फ़िल्टर करें

source: Select Expertise
hi: विशेषज्ञता चुनें

source: No lawyers available
hi: कोई वकील उपलब्ध नहीं है

source: Close
hi: बंद करें

# selectRole
source: Select Your Role
hi: अपनी भूमिका चुनें

source: User
hi: उपयोगकर्ता

source: Lawyer
hi: वकील

# continueText
source: Continue
hi: जारी रखें

source: Bio
hi: जैव

# bioHint
source: Tell us about yourself...
hi: खुद के बारे में बताएं...

# bioRequired
source: Bio is required.
hi: बायो आवश्यक है।

source: years
hi: वर्ष

source: Apply
hi: लागू करें

source: Search by Name
hi: नाम से खोजें

source: Reset Filters
hi: फ़िल्टर रीसेट करें

source: Phone
hi: फ़ोन

source: State
hi: राज्य

source: District
hi: जिला

# stateRequired
source: State is required.
hi: राज्य आवश्यक है।

# districtRequired
source: District is required.
hi: जिला आवश्यक है।

source: Contacting Lawyer
hi: वकील से संपर्क करना

source: Contact Lawyer
hi: वकील से संपर्क करें

source: Filter by Location
hi: स्थान के आधार पर फ़िल्टर करें

source: Select District
hi: जिला चुनें

source: Cancel
hi: रद्द करें

source: Search by Name or District
hi: नाम या जिला से खोजें

source: Switch to Name Search
hi: नाम खोज पर स्विच करें

source: Switch to District Search
hi: जिला खोज पर स्विच करें

source: Reset
hi: रीसेट

# noMatchingLawyers
source: No matching lawyers found
hi: कोई मिलान करने वाले वकील नहीं मिले

source: Location
hi: स्थान

source: Search by District
hi: जिले के अनुसार खोजें

source: Profile saved successfully!
hi: प्रोफ़ाइल सफलतापूर्वक सहेजी गई!

# invalidNumber
source: Invalid number. Please enter a valid 10-digit phone number.
hi: अमान्य नंबर। कृपया एक वैध 10-अंकीय फ़ोन नंबर दर्ज करें।

# noMoreContent
source: No more content available
hi: कोई और सामग्री उपलब्ध नहीं है

source: View Profile
hi: प्रोफाइल देखें

source: Lawyer Profile
hi: वकील प्रोफाइल

source: Login
hi: लॉगिन

source: Sign Up
hi: साइन अप

source: Password
hi: पासवर्ड

# passwordRequired
source: Password is required
hi: पासवर्ड आवश्यक है

# passwordTooShort
source: Password must be at least 6 characters
hi: पासवर्ड कम से कम 6 अक्षरों का होना चाहिए

# noAccountSignup
source: Don't have an account? Sign Up
hi: खाता नहीं है? साइन अप करें

# haveAccountLogin
source: Already have an account? Login
hi: पहले से खाता है? लॉगिन करें

source: Logout
hi: लॉगआउट

source: Logged out successfully
hi: सफलतापूर्वक लॉग आउट हो गया

source: Chat with Lawyer
hi: वकील के साथ चैट करें

source: Chat with
hi: के साथ चैट करें

# typeMessage
source: Type a message...
hi: संदेश टाइप करें...

# noMessages
source: No messages found
hi: कोई संदेश नहीं मिला

# startConversation
source: Start a conversation
hi: वार्तालाप शुरू करें

# chatComingSoon
source: Chat feature coming soon!
hi: चैट सुविधा जल्द ही आ रही है!

source: Profile
hi: प्रोफाइल

source: Language
hi: ाषा

source: Contact Developer
hi: डेवलपर से संपर्क करें

source: ok
hi: ठीक है
